// ==============>  ЦИКЛ FOR  <=====================

// for (ініціалізація; умова; пост - вираз)
// тіло цикла
// for (let i = 0; i < 5; i += 1) {
//     console.log(i);
//     }
// console.log(`qeqeqeq`)


// @@@   Pre-increment і Post-increment   @@@
// Не використовувати
// for (let i = 0; i < 5; i ++ або ++i) {
//     console.log(i);
//     }
// console.log(`qeqeqeq`)


// @@@   Задача№1   @@@
// Напиши скрипт котрий підраховує загальну суму зарплат працівників
// Кількість працівників зберігається в змінній employees
// Зарплата кожного працівника це випадкове число від 500 до 5000
// Записати суму в змінну totalSalary і вивести в консоль

// План виконання:
// 1. зробити вари
// const minSalary = 500;
// const maxSalary = 5000;
// const employees = 3;
// let totalSalary = 0;
// 2. перебрати працівників в циклі
// for (let i = 1; i <= employees; i += 1) {
// 3. згенерувати випадкову ЗП
//     const salary = Math.round(
//         Math.random() * (maxSalary - minSalary) + minSalary,
//     );
//     console.log(`ЗП працівника номер ${i} - ${salary}`);
//     // 4. додати до total
//     totalSalary += salary;
// }

// 5. лог
// console.log(`totalSalary: `, totalSalary);

// @@@   Задача№2   @@@
// Напиши скрипт котрий підраховує суму всих парних чисел,
// котрі входять діапазон чисел в змінних від min до max
// Наприклад якщо min=0 і max=5 то діапазон 0-5,
// і в ньому два парних числа 2 і 4, їх сума = 6

// План виконання:
// 1. зробити вари
// const min = 0;
// const max = 10;
// let total = 0;

// 2. for від min до max з кроком 1
// for (let i = min; i <= max; i += 1) {
//     console.log(i);

// 3. перевіряємо залишок від ділення
//     if (i % 2 === 0) {
//         console.log(`парне число: `, i);

//         total += i;
//     }
// }
// 4. пишемо в суму
// console.log(`total: `, total);

// Більш правильне вирішення задачі.
// const min = 0;
// const max = 10;
// let total = 0;

// for (let i = min; i <= max; i += 1) {
//     console.log(i);
//     if (i % 2 !== 0) {
//         console.log(`непарне число: `, i);
//         continue;
//     }
//     console.log(`парне число: `, i);
//     total += i;
// }
// console.log(`total: `, total);

// @@@   Задача№3   @@@
// Напиши скрипт обробки покупки в магазині
// - Баланс користувача знаходиться у змінній balance
// - Сума покупки зберігається у змінній payment
// - Перед перевіркою вивести повідомлення:
// 'Загальна вартість замовлення [число] кредитів. Перевіряємо кількість
// доступних коштів на рахунку'
// Якщо сума покупки не перевищує баланс:
// - Відняти від баланса суму покупки
// - Вивести повідомлення 'На рахунку залишилось [число] кредитів'
// Якщо сума покупки перевищує баланс:
// - Вивести повідомлення 'На рахунку недостатньо коштів для проведення операції!'
// В кінці вивести повідомлення 'Операція завершена'

// План виконання:
// 1. зробити вари
// let balance = 100;
// const payment = 2000;

// console.log(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`);
// 2. умова сума <= баланс
// if (balance >= payment) {
//     balance -= payment;
//     console.log(`На рахунку залишилось ${balance} кредитів`);
// } else {
//     console.log(`На рахунку недостатньо коштів для проведення операції!`);
// }
// console.log(`Операція завершена`);

// @@@   Задача№4   @@@
// Напиши скрипт підрахунку суми покупки зі знижкою в залежності від витраченої
// суми за весь час (партнерська програма)
// - Загальна сума витраченого зберігається у змінній totalSpent
// - Сума поточного платежу зберігається у змінній payment
// - Знижка зберігається у змінній discount
//
// - Якщо витрачено від [100 до 1000), бронзовний партнер, знижка - 2%
// - Якщо витрачено від [1000 до 5000), срібний партнер, знижка - 5%
// - Якщо витрачено більше [5000, золотий партнер, знижка - 10%
// - Якщо витрачено меньше 100), не партнер, знижка - 0%
//
// В результаті вивести повідомлення:
// 'Оформляємо замовлення на суму [сума] зі знижкою [знижка]%'

// let totalSpent = 100080;
// let payment = 20;
// let discount = 0;

// if (totalSpent < 100) {
//     console.log(`не партнер, знижка - 0%`);
//     discount = 0;
// } else if (totalSpent >= 100 && totalSpent < 1000) {
//     console.log(`бронзовний партнер, знижка - 2%`);
//     discount = 0.02;
// } else if (totalSpent >= 1000 && totalSpent < 5000) {
//     console.log(`срібний партнер, знижка - 5%`);
//     discount = 0.05;
// } else {
//     console.log(`золотий партнер, знижка - 10%`);
//     discount = 0.1;
// } 
// payment = payment - payment * discount;

// console.log(`Оформляємо замовлення на суму ${payment} зі знижкою ${discount * 100}%`);

// totalSpent += payment;
// console.log(`Загальна сума витраченого в магазині ${totalSpent}`);