// Ви просите користувача ввести суму його зарплати. Потім розраховуєте:

// Добавку у вигляді премії у сумі 15% від зарплати.
// Податки у сумі 10% від суми всіх нарахувань (зарплата + премія).
// Витрату в магазині в сумі 190.
// Розділяєте суму, що залишилася, між користувачем і його "дружиною"/"чоловіком".

// Виводьте скільки залишилося в результаті всіх операцій грошей у користувача.

// let salary = Number(prompt(`ввести суму його зарплати`));
// salary *= 1.15;
// alert(`розмір вашої ЗП разом з премією складає ${salary}`);
// salary *= 0.9;
// alert(`після сплати податків розмір ЗП складає ${salary}`);
// salary -= 190;
// alert(`після відвідування магазину в нас залишилось ${salary}`);
// salary /= 2;
// alert(`залишилось від ЗП ${salary}`);

// console.log(salary);
// =================================================================

// Щасливим квитком називають такий квиток із шестизначним номером,
// де сума перших трьох цифр дорівнює сумі останніх трьох.
// Напишіть функцію checkTicket(number), яка перевіряє щасливість квитка.

//checkTicket('005212') === true
//checkTicket('133700') === true
//checkTicket('123032') === false
// let total1 = 0;
// let total2 = 0;

// const checkTicket = function(string) {
    


// }

// checkTicket('005212');
// checkTicket('133700');
// checkTicket('123032');