// ===============>   SWITCH   <===============
// Задача№1:
// Напиши скрипт вибору вартості готеля по кількості зірок:
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
// якщо в змінній stars щось крім чисел 1 - 5, виведи стічку
// 'Такої кількості зірок немає'

// const stars = 2;
// let price;

// @@@   ВИРІШЕННЯ №1  @@@
// if(stars === 1) {
//     price = 20;
// } else if (stars === 2) {
//     price = 30;
// } else if (stars === 3) {
//     price = 50;
// } else if (stars === 4) {
//     price = 70;
// } else if (stars === 5) {
//     price = 120;
// } else {
//     console.log('Такої кількості зірок немає')
// };
// console.log(price);

// @@@   ВИРІШЕННЯ №2  @@@
// switch (stars) {
//     case 1:
//         price = 20;
//         break;
//     case 2:
//         price = 30;
//         break;
//     case 3:
//         price = 50;
//         break;
//     case 4:
//         price = 70;
//         break;
//     case 5:
//         price = 120;
//         break;
//     default: console.log('Такої кількості зірок немає')
// }
// console.log(price);

// Задача№2:
// Напиши скрипт вибору вартості готеля по кількості зірок:
// 1,2 - 20$, 3,4 - 30$, 5 - 120$
// якщо в змінній stars щось крім чисел 1 - 5, виведи стічку
// 'Такої кількості зірок немає'

// const stars = 2;
// let price;

// @@@   ВИРІШЕННЯ №1  @@@
// if(stars === 1 || stars === 2) {
//     price = 20;
// } else if (stars === 3 || stars === 4) {
//     price = 30;
// } else if (stars === 5) {
//     price = 120;
// } else {
//     console.log('Такої кількості зірок немає')
// };
// console.log(price);

// @@@   ВИРІШЕННЯ №2  @@@
// switch (stars) {
//     case 1:
//     case 2:
//         price = 20;
//         break;
//     case 3:
//     case 4:
//         price = 30;
//         break;
//     case 5:
//         price = 120;
//         break;
//     default: console.log('Такої кількості зірок немає')
// }
// console.log(price);


// Задача№3:
// Напиши скрипт вибору опції доставки товару.
// Опції зберігаються у змінній option:
// 1 - самовивіз, 2 - курєр, 3 - пошта

// У змінну message записати повідомлення в залежності від опції:
// - 'Ви можете забрати товар завтра з 12-00 в нашому офісі'
// - 'Курєр доставить замовлення завтра з 09-00 до 18-00'
// - 'Пошта буде відправлена сьогодні'
// - 'Вам зателефонує менеджер'

// План виконання:
// 1. зробити змінну
// const option = 75;
// let message = ``;

// 2. зробити switch 1 2 3
// 3. в кожному кейсі записати в message стрічку
// switch (option) {
//     case 1:
//         message = 'Ви можете забрати товар завтра з 12-00 в нашому офісі';
//         break;
//     case 2:
//         message = 'Курєр доставить замовлення завтра з 09-00 до 18-00';
//         break;
//     case 3:
//         message = 'Пошта буде відправлена сьогодні';
//         break;
//     default:
//         message = 'Вам зателефонує менеджер';    
// }
// 4. зробити log message
// console.log(message);

 

